%---------------------------------------------------------------------------------------
%  exa030402.m,  for fig 3.4.2
%  说明在计算WVD时，加窗和不加窗的影响;
%
%  注：在该程序中，用到了子程序 tfrwv.m,
%      还要用到显示程序 tfrqview及其他程序，
%      所有这些程序请读者在如下的网站上下载:
%                      http://crttsn.univ-nantes.fr/~auger/tftb.html
%      因为该网站上的时频分析软件并没有列入MATLAB的工具箱，涉及到知识产权问题，
%      因此不能将其列入国内公开出版物上，但读者可以自由下载。
%----------------------------------------------------------------------------------------
clear;

n=256;
t=1:n;
   w=pi/8;
   for k=1:n/4,
      signal(k)=exp(j*1*k*w);
   end;
   for k=n/4:n/2,
     signal(k)=exp(j*2.5*k*w);
   end;
   for k=n/2:n,
      signal(k)=exp(j*3.5*k*w);
   end;

tfrwv(signal');

