%---------------------------------------------------------------------------------------
%  exa011001.m,  for  example 1.10.1 and fig 1.10.2
%  求线性调频信号的Zak变换
%  注：在该程序中，用到了子程序 divider.m 及 zak.m，
%      所有这些程序请读者在如下的网站上下载:
%                      http://crttsn.univ-nantes.fr/~auger/tftb.html
%      因为该网站上的时频分析软件并没有列入MATLAB的工具箱，涉及到知识产权问题，
%      因此不能将其列入国内公开出版物上，但读者可以自由下载。
%----------------------------------------------------------------------------------------
clear;
sig=fmlin(300);

DZT=zak(sig);
imagesc(abs(DZT));
ylabel(' Frequency');
xlabel(' Time');
