%---------------------------------------------------------------------------------------
%  exa040601cd.m,  for  example 4.6.1 and fig 4.6.1(c)和(d)
%  BJ分布在四个域内的形状;
%
%----------------------------------------------------------------------------------------
clear;

n=64;
for t=1:n;
   for f=1:n;
      tt=t-n/2;
      ff=f-n/2;
      if abs(ff)>=2*abs(tt)
         g(t,f)=2*pi;
      else
         g(t,f)=0;
      end
      if ff~=0
         g(t,f)=g(t,f)/abs(ff);
         end
   end
end
t=-n/2+1:n/2;
f=-n/2+1:n/2;
subplot(223)
surfl(t,f,rot90(g),[-37,5,60]);
subplot(224)
surfl(t,f,rot90(g),[-37,5,60]);


